app/controllers/api/sessions_controller.rb

    def show
        @user = User.find_by(username: params[:user][:username].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]