app/controllers/api/users_controller.rb

    def create
        correct_params = user_params.deep_dup
        correct_params[:username] = correct_params[:username].downcase
        @user = User.new(correct_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"