app/controllers/static_pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "y"], ["LIMIT", 1]]
---
    def root
        if (params[:username])
            user = User.find_by(username: params[:username])